#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>
        
```


```
        
</details>
        
#### Terraform Plan 📖``
        
<details><summary>Show Plan</summary>
        
```

terraform
Acquiring state lock. This may take a few moments...
null_resource.default: Refreshing state... [id=2182437570605761994]
google_project_service.gce: Refreshing state... [id=gde-ihommani/run.googleapis.com]
google_project_service.project: Refreshing state... [id=gde-ihommani/run.googleapis.com]
google_cloud_run_v2_service.frontend: Refreshing state... [id=projects/gde-ihommani/locations/europe-west1/services/cloudrun-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.frontend will be created
  + resource "google_cloud_run_v2_service" "frontend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "cloudrun-service"
      + observed_generation     = (known after apply)
      + project                 = "gde-ihommani"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "us-docker.pkg.dev/cloudrun/container/hello"
            }
        }
    }

  # null_resource.echo_smthg will be created
  + resource "null_resource" "echo_smthg" {
      + id = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```
        
</details>
        
*Pusher: @ihommani, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure integration and deployment`*